#include "aduc812.h"
#include "int_sio.h"
#include "fifo.h"
#include "led.h"
#include "util.h"

static fifo_t rFifo;
static fifo_t wFifo;

void SIO_ISR( void ) __interrupt ( 4 ) {	
	if(TI) {
		TI = 0;
		if (!isEmpty(&wFifo)) {
			SBUF = pullElement(&wFifo);
		}
    }
    if(RI) {
		unsigned char t = SBUF;
        pushElement(&rFifo, t);
		RI = 0;
    }
}

/**----------------------------------------------------------------------------
                        init_sio()
-------------------------------------------------------------------------------
Инициализирует последовательный канал на заданной скорости. Использует таймер 1

Вход:       char speed - скорость. Задается константами, описанными в 
                заголовочном файле sio.h
            bit sdouble - дублирование скорости: 0 - не дублировать скорость,
                заданную аргументом speed; 1 - дублировать.
Выход:      нет
Результат:  нет
----------------------------------------------------------------------------- */
void init_sio( unsigned char speed )
{
    initFifo(&rFifo);
    initFifo(&wFifo);
    
    SetVector( 0x2023, (void *)SIO_ISR );
	
    TH1       =  speed;
    TMOD     |=  0x20; //Таймер 1 будет работать в режиме autoreload
    TCON     |=  0x40; //Запуск таймера 1
    SCON      =  0x50; //Настройки последовательного канала
    ES        =  1;    // Enable serial interrupt
    EA        =  0;     // Disable any interrupt	
}

/**----------------------------------------------------------------------------
                        RSioStat()
-------------------------------------------------------------------------------
Возвращает ненулевое значение, если буфер приема не пуст

Вход:       нет
Выход:      нет
Результат:  0 - буфер приема пуст;
            1 - был принят символ
----------------------------------------------------------------------------- */
unsigned char rsiostat(void)  
{
	if (0/*g_mode == MODE_CHAR*/) {
		return RI;
	}
	else {
		return !isEmpty(&rFifo);
	}
	
}


/**----------------------------------------------------------------------------
                        wsio
-------------------------------------------------------------------------------
Отправляет символ по последовательному каналу

Вход:       unsigned char c - символ, который нужно отправить
Выход:      нет
Результат:  нет
----------------------------------------------------------------------------- */
void wsio( unsigned char c )
{	
	if (0) { //g_mode == MODE_CHAR) {
		SBUF = c;
		TI   = 0;
		while( !TI );
	}
	else {
		char oldES = ES;
		int fifoWasEmpty;
		ES = 0;
		
		fifoWasEmpty = isEmpty(&wFifo);

		pushElement(&wFifo, c);    
		if (fifoWasEmpty) {
			TI = 1;		
		}    
		ES = oldES;
	}
    		
}

/**----------------------------------------------------------------------------
                        rsio()
-------------------------------------------------------------------------------
Дожидается приема символа из последовательного канала и возвращает его.

Вход:       нет
Выход:      нет
Результат:  принятый символ
----------------------------------------------------------------------------- */
unsigned char rsio(void)
{	
	if (0){//g_mode == MODE_CHAR) {
		while( !RI );
		RI = 0;
		return SBUF;
	}
	else {
		unsigned char c;
		char oldES = ES;
		
		ES = 0;
		
		if (isEmpty(&rFifo)) {
			c = 0;
		}
		else {
			c = pullElement(&rFifo);
		}
		
		ES = oldES;
		return c;
	}
    
}


/**----------------------------------------------------------------------------
                        type()
-------------------------------------------------------------------------------
Выводит ASCIIZ-строку в последовательный канал

Вход:       char *str - указатель на строку
Выход:      нет
Результат:  нет
----------------------------------------------------------------------------- */
void type(char * str)
{
	if (0) {//g_mode == MODE_CHAR) {	
		while( *str ) wsio( *str++ );
	}
	else {
		char oldES = ES;
		int fifoWasEmpty;
		static int max_size = 0;
		ES = 0;
		
		fifoWasEmpty = isEmpty(&wFifo);

		while( *str ) {
			pushElement(&wFifo,*str++);
		}
		if (fifoWasEmpty) {
			TI = 1;		
		}    
		ES = oldES;	
	}
}

